sleemanj/optiboot/dists/diy_attiny/avr/boards.txt
attiny25_diy.menu.clock.16MHz=16MHz Crystal/Resonator
attiny25_diy.menu.clock.16MHz.build.f_cpu=16000000L
attiny25_diy.menu.clock.16MHz.bootloader.low_fuses=0xFF

attiny25_diy.menu.clock.1MHz=1MHz Internal Oscillator
attiny25_diy.menu.clock.1MHz.build.f_cpu=1000000L
attiny25_diy.menu.clock.1MHz.bootloader.low_fuses=0x62
attiny25_diy.menu.clock.1MHz.upload.speed=9600

# Core Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
attiny25_diy.menu.core.SmallerCore=Millis Available, No Tone
attiny25_diy.menu.core.SmallerCore.build.variant=tinyX5
attiny25_diy.menu.core.SmallerCore.build.core=tiny
attiny25_diy.menu.core.SmallerCore.build.extra_flags=-DNO_TONE

attiny25_diy.menu.core.FullCore=Millis and Tone Available
attiny25_diy.menu.core.FullCore.build.variant=tinyX5
attiny25_diy.menu.core.FullCore.build.core=tiny
attiny25_diy.menu.core.FullCore.build.extra_flags=

attiny25_diy.menu.core.SmallestCore=No Millis, No Tone
attiny25_diy.menu.core.SmallestCore.build.variant=tinyX5
attiny25_diy.menu.core.SmallestCore.build.core=tiny
attiny25_diy.menu.core.SmallestCore.build.extra_flags=-DNO_MILLIS -DNO_TONE

# Print Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
attiny25_diy.menu.print.BinHexDec=Bin, Hex, Dec Supported
attiny25_diy.menu.print.BinHexDec.build.custom_flags.print.use_base=-DPRINT_USE_BASE_BIN -DPRINT_USE_BASE_DEC -DPRINT_USE_BASE_HEX

# The Tiny13 doesn't have enough RAM to be able to use Arbitrary Bases
# attiny25_diy.menu.print.Arbitrary=Full Support For Arbitrary Bases (Biggest)
# attiny25_diy.menu.print.Arbitrary.build.custom_flags.print.use_base=-DPRINT_USE_BASE_ARBITRARY

attiny25_diy.menu.print.BinHexDecOct=Bin, Hex, Dec, Oct Supported
attiny25_diy.menu.print.BinHexDecOct.build.custom_flags.print.use_base=-DPRINT_USE_BASE_BIN -DPRINT_USE_BASE_DEC -DPRINT_USE_BASE_HEX -DPRINT_USE_BASE_OCT

attiny25_diy.menu.print.Dec=Dec Only Supported
attiny25_diy.menu.print.Dec.build.custom_flags.print.use_base=-DPRINT_USE_BASE_DEC

attiny25_diy.menu.print.Hex=Hex Only Supported
attiny25_diy.menu.print.Hex.build.custom_flags.print.use_base=-DPRINT_USE_BASE_HEX

attiny25_diy.menu.print.Oct=Oct Only Supported
attiny25_diy.menu.print.Oct.build.custom_flags.print.use_base=-DPRINT_USE_BASE_OCT

attiny25_diy.menu.print.Bin=Bin Only Supported (Smallest)
attiny25_diy.menu.print.Bin.build.custom_flags.print.use_base=-DPRINT_USE_BASE_BIN

# Millis Accuracy
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
attiny25_diy.menu.millis_ppm.1p6=Better Or Equal 1.666% Error (Default)
attiny25_diy.menu.millis_ppm.1p6.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=16666UL

attiny25_diy.menu.millis_ppm.50p=Better Or Equal 50% Error (Lowest Code Use)
attiny25_diy.menu.millis_ppm.50p.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=500000UL

attiny25_diy.menu.millis_ppm.25p=Better Or Equal 25% Error
attiny25_diy.menu.millis_ppm.25p.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=250000UL

attiny25_diy.menu.millis_ppm.10p=Better Or Equal 10% Error
attiny25_diy.menu.millis_ppm.10p.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=100000UL

attiny25_diy.menu.millis_ppm.5p=Better Or Equal 5% Error
attiny25_diy.menu.millis_ppm.5p.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=50000UL

attiny25_diy.menu.millis_ppm.2p5=Better Or Equal 2.5% Error
attiny25_diy.menu.millis_ppm.2p5.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=25000UL

attiny25_diy.menu.millis_ppm.1p=Better Or Equal 1% Error
attiny25_diy.menu.millis_ppm.1p.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=10000UL

attiny25_diy.menu.millis_ppm.0p5=Better Or Equal 0.5% Error
attiny25_diy.menu.millis_ppm.0p5.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=5000UL

attiny25_diy.menu.millis_ppm.0p25=Better Or Equal 0.25% Error
attiny25_diy.menu.millis_ppm.0p25.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=2500UL

attiny25_diy.menu.millis_ppm.0p1=Better Or Equal 0.1% Error (Highest Code Use)
attiny25_diy.menu.millis_ppm.0p1.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=1000UL

# Link Time Optimisation
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
attiny25_diy.menu.lto.enable=LTO Enabled
attiny25_diy.menu.lto.enable.ltocflags=-flto -DLTO_ENABLED -fno-fat-lto-objects
attiny25_diy.menu.lto.enable.ltoelfflags=-g -flto -DLTO_ENABLED -fuse-linker-plugin
attiny25_diy.menu.lto.enable.ltocppflags=-flto -DLTO_ENABLED
attiny25_diy.menu.lto.enable.ltoarcmd=gcc-
attiny25_diy.menu.lto.disable=LTO Disabled
attiny25_diy.menu.lto.disable.ltocflags=
attiny25_diy.menu.lto.disable.ltoelfflags=
attiny25_diy.menu.lto.disable.ltocppflags=
attiny25_diy.menu.lto.disable.ltoarcmd=

# BOD Level Fuse Bits
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
attiny25_diy.menu.bodlevel.2v7=2.7v
attiny25_diy.menu.bodlevel.2v7.bootloader.bod_bits=101
attiny25_diy.menu.bodlevel.disabled=Disabled
attiny25_diy.menu.bodlevel.disabled.bootloader.bod_bits=111
attiny25_diy.menu.bodlevel.4v3=4.3v
attiny25_diy.menu.bodlevel.4v3.bootloader.bod_bits=100
attiny25_diy.menu.bodlevel.1v8=1.8v
attiny25_diy.menu.bodlevel.1v8.bootloader.bod_bits=110

# }}}

# {{{ ############### ATtiny45 #################################################

attiny45_diy.name=ATtiny45
attiny45_diy.build.mcu=attiny45
attiny45_diy.bootloader.low_fuses=0xE2
# attiny45_diy.bootloader.high_fuses=0xDD
attiny45_diy.bootloader.bod_bits=101
attiny45_diy.bootloader.high_fuses=0b11011{bootloader.bod_bits}
attiny45_diy.bootloader.extended_fuses=0xFF
attiny45_diy.bootloader.unlock_bits=0xFF
attiny45_diy.bootloader.lock_bits=0xFF
attiny45_diy.build.f_cpu=8000000L
attiny45_diy.upload.speed=57600
attiny45_diy.build.core=tiny
attiny45_diy.build.variant=tiny8
attiny45_diy.build.board=ATTINY45_DIY
attiny45_diy.upload.tool=diy_attiny:avrdude
attiny45_diy.bootloader.tool=diy_attiny:avrdude
attiny45_diy.upload.maximum_data_size=256

# Version Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# No sense having this menu, until there is another version
# attiny45_diy.menu.version.attiny45 = ATtiny45
# attiny45_diy.menu.version.attiny45.build.mcu = attiny45

