sleemanj/optiboot/dists/diy_attiny/avr/boards.txt
# BOD Level Fuse Bits
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
attiny45_diy.menu.bodlevel.2v7=2.7v
attiny45_diy.menu.bodlevel.2v7.bootloader.bod_bits=101
attiny45_diy.menu.bodlevel.disabled=Disabled
attiny45_diy.menu.bodlevel.disabled.bootloader.bod_bits=111
attiny45_diy.menu.bodlevel.4v3=4.3v
attiny45_diy.menu.bodlevel.4v3.bootloader.bod_bits=100
attiny45_diy.menu.bodlevel.1v8=1.8v
attiny45_diy.menu.bodlevel.1v8.bootloader.bod_bits=110

# }}}

# {{{ ############### ATtiny85 #################################################

attiny85_diy.name=ATtiny85
attiny85_diy.build.mcu=attiny85
attiny85_diy.bootloader.low_fuses=0xE2
# attiny85_diy.bootloader.high_fuses=0xDD
attiny85_diy.bootloader.bod_bits=101
attiny85_diy.bootloader.high_fuses=0b11011{bootloader.bod_bits}
attiny85_diy.bootloader.extended_fuses=0xFF
attiny85_diy.bootloader.unlock_bits=0xFF
attiny85_diy.bootloader.lock_bits=0xFF
attiny85_diy.build.f_cpu=8000000L
attiny85_diy.upload.speed=57600
attiny85_diy.build.core=tiny
attiny85_diy.build.variant=tiny8
attiny85_diy.build.board=ATTINY85_DIY
attiny85_diy.upload.tool=diy_attiny:avrdude
attiny85_diy.bootloader.tool=diy_attiny:avrdude
attiny85_diy.upload.maximum_data_size=512

# Version Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# No sense having this menu, until there is another version
# attiny85_diy.menu.version.attiny85 = ATtiny85
# attiny85_diy.menu.version.attiny85.build.mcu = attiny85

# Bootloader Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

attiny85_diy.menu.boot.optiboot=Yes (Normal Arduino Serial/USB Upload)
attiny85_diy.menu.boot.optiboot.upload.protocol=arduino
attiny85_diy.menu.boot.optiboot.upload.maximum_size=7634
attiny85_diy.menu.boot.optiboot.bootloader.extended_fuses=0xFE
attiny85_diy.menu.boot.optiboot.bootloader.file=optiboot_{build.mcu}_{build.f_cpu}_{upload.speed}.hex

attiny85_diy.menu.boot.optiboot_notune=Yes, Without Tuner
attiny85_diy.menu.boot.optiboot_notune.upload.protocol=arduino
attiny85_diy.menu.boot.optiboot_notune.upload.maximum_size=7634
attiny85_diy.menu.boot.optiboot_notune.bootloader.extended_fuses=0xFE
attiny85_diy.menu.boot.optiboot_notune.bootloader.file=notuner_optiboot_{build.mcu}_{build.f_cpu}_{upload.speed}.hex

attiny85_diy.menu.boot.none=No (ISP Programmer Upload)
attiny85_diy.menu.boot.none.upload.maximum_size=8192
attiny85_diy.menu.boot.none.bootloader.tool=diy_attiny:avrdude_nobootloader

# Speed Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

attiny85_diy.menu.clock.8MHz=8MHz Internal Oscillator
attiny85_diy.menu.clock.8MHz.build.f_cpu=8000000L
attiny85_diy.menu.clock.8MHz.bootloader.low_fuses=0xE2

attiny85_diy.menu.clock.16MHz=16MHz Crystal/Resonator
attiny85_diy.menu.clock.16MHz.build.f_cpu=16000000L
attiny85_diy.menu.clock.16MHz.bootloader.low_fuses=0xFF

attiny85_diy.menu.clock.1MHz=1MHz Internal Oscillator
attiny85_diy.menu.clock.1MHz.build.f_cpu=1000000L
attiny85_diy.menu.clock.1MHz.bootloader.low_fuses=0x62
attiny85_diy.menu.clock.1MHz.upload.speed=9600

# Core Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
attiny85_diy.menu.core.FullCore=Millis and Tone Available
attiny85_diy.menu.core.FullCore.build.variant=tinyX5
attiny85_diy.menu.core.FullCore.build.core=tiny
attiny85_diy.menu.core.FullCore.build.extra_flags=

attiny85_diy.menu.core.SmallerCore=Millis Available, No Tone
attiny85_diy.menu.core.SmallerCore.build.variant=tinyX5
attiny85_diy.menu.core.SmallerCore.build.core=tiny
attiny85_diy.menu.core.SmallerCore.build.extra_flags=-DNO_TONE

attiny85_diy.menu.core.SmallestCore=No Millis, No Tone
attiny85_diy.menu.core.SmallestCore.build.variant=tinyX5
attiny85_diy.menu.core.SmallestCore.build.core=tiny
attiny85_diy.menu.core.SmallestCore.build.extra_flags=-DNO_MILLIS -DNO_TONE

# Print Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
attiny85_diy.menu.print.BinHexDec=Bin, Hex, Dec Supported
attiny85_diy.menu.print.BinHexDec.build.custom_flags.print.use_base=-DPRINT_USE_BASE_BIN -DPRINT_USE_BASE_DEC -DPRINT_USE_BASE_HEX

attiny85_diy.menu.print.Arbitrary=Full Support For Arbitrary Bases (Biggest)
attiny85_diy.menu.print.Arbitrary.build.custom_flags.print.use_base=-DPRINT_USE_BASE_ARBITRARY

attiny85_diy.menu.print.BinHexDecOct=Bin, Hex, Dec, Oct Supported
attiny85_diy.menu.print.BinHexDecOct.build.custom_flags.print.use_base=-DPRINT_USE_BASE_BIN -DPRINT_USE_BASE_DEC -DPRINT_USE_BASE_HEX -DPRINT_USE_BASE_OCT

attiny85_diy.menu.print.Dec=Dec Only Supported
attiny85_diy.menu.print.Dec.build.custom_flags.print.use_base=-DPRINT_USE_BASE_DEC

attiny85_diy.menu.print.Hex=Hex Only Supported
attiny85_diy.menu.print.Hex.build.custom_flags.print.use_base=-DPRINT_USE_BASE_HEX

attiny85_diy.menu.print.Oct=Oct Only Supported
attiny85_diy.menu.print.Oct.build.custom_flags.print.use_base=-DPRINT_USE_BASE_OCT

attiny85_diy.menu.print.Bin=Bin Only Supported (Smallest)
attiny85_diy.menu.print.Bin.build.custom_flags.print.use_base=-DPRINT_USE_BASE_BIN


# Millis Accuracy
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
attiny85_diy.menu.millis_ppm.1p6=Better Or Equal 1.666% Error (Default)
attiny85_diy.menu.millis_ppm.1p6.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=16666UL

attiny85_diy.menu.millis_ppm.50p=Better Or Equal 50% Error (Lowest Code Use)
attiny85_diy.menu.millis_ppm.50p.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=500000UL

attiny85_diy.menu.millis_ppm.25p=Better Or Equal 25% Error
attiny85_diy.menu.millis_ppm.25p.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=250000UL

attiny85_diy.menu.millis_ppm.10p=Better Or Equal 10% Error
attiny85_diy.menu.millis_ppm.10p.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=100000UL

