sleemanj/optiboot/dists/diy_attiny/avr/boards.txt
attiny85_diy.menu.millis_ppm.5p=Better Or Equal 5% Error
attiny85_diy.menu.millis_ppm.5p.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=50000UL

attiny85_diy.menu.millis_ppm.2p5=Better Or Equal 2.5% Error
attiny85_diy.menu.millis_ppm.2p5.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=25000UL

attiny85_diy.menu.millis_ppm.1p=Better Or Equal 1% Error
attiny85_diy.menu.millis_ppm.1p.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=10000UL

attiny85_diy.menu.millis_ppm.0p5=Better Or Equal 0.5% Error
attiny85_diy.menu.millis_ppm.0p5.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=5000UL

attiny85_diy.menu.millis_ppm.0p25=Better Or Equal 0.25% Error
attiny85_diy.menu.millis_ppm.0p25.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=2500UL

attiny85_diy.menu.millis_ppm.0p1=Better Or Equal 0.1% Error (Highest Code Use)
attiny85_diy.menu.millis_ppm.0p1.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=1000UL

# Link Time Optimisation
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
attiny85_diy.menu.lto.enable=LTO Enabled
attiny85_diy.menu.lto.enable.ltocflags=-flto -DLTO_ENABLED -fno-fat-lto-objects
attiny85_diy.menu.lto.enable.ltoelfflags=-g -flto -DLTO_ENABLED -fuse-linker-plugin
attiny85_diy.menu.lto.enable.ltocppflags=-flto -DLTO_ENABLED
attiny85_diy.menu.lto.enable.ltoarcmd=gcc-
attiny85_diy.menu.lto.disable=LTO Disabled
attiny85_diy.menu.lto.disable.ltocflags=
attiny85_diy.menu.lto.disable.ltoelfflags=
attiny85_diy.menu.lto.disable.ltocppflags=
attiny85_diy.menu.lto.disable.ltoarcmd=

# BOD Level Fuse Bits
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
attiny85_diy.menu.bodlevel.2v7=2.7v
attiny85_diy.menu.bodlevel.2v7.bootloader.bod_bits=101
attiny85_diy.menu.bodlevel.disabled=Disabled
attiny85_diy.menu.bodlevel.disabled.bootloader.bod_bits=111
attiny85_diy.menu.bodlevel.4v3=4.3v
attiny85_diy.menu.bodlevel.4v3.bootloader.bod_bits=100
attiny85_diy.menu.bodlevel.1v8=1.8v
attiny85_diy.menu.bodlevel.1v8.bootloader.bod_bits=110


# }}}

























################################################################################
# ATtiny24/A, ATtiny44/A, ATtiny84/A
#
# Note, there is no bootloader section, so we can not do any locking.
#
# Lock Bits Note
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
#  avrdude DOES NOT mask the lock bits on the x4, therefore
#
#    0xFF = No Locking
#    0xFE = Read Locking
#    0xFC = Read and Write Locking
#
# Extended Fuses Note
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
#  avrdude DOES NOT mask the extended fuses on the x4, the engbedded.com 
#  calulator's suggestion for alternative efuse settings is incorrect.
#
#
################################################################################

# {{{ ############### ATtiny24 #################################################

attiny24_diy.name=ATtiny24
attiny24_diy.build.mcu=attiny24
attiny24_diy.bootloader.low_fuses=0xE2
# attiny24_diy.bootloader.high_fuses=0xDD
attiny24_diy.bootloader.bod_bits=101
attiny24_diy.bootloader.high_fuses=0b11011{bootloader.bod_bits}
attiny24_diy.bootloader.extended_fuses=0xFF
attiny24_diy.bootloader.unlock_bits=0xFF
attiny24_diy.bootloader.lock_bits=0xFF
attiny24_diy.build.f_cpu=8000000L
attiny24_diy.upload.speed=57600
attiny24_diy.build.core=tiny
attiny24_diy.build.variant=tiny8
attiny24_diy.build.board=ATTINY24_DIY
attiny24_diy.upload.tool=diy_attiny:avrdude
attiny24_diy.bootloader.tool=diy_attiny:avrdude
attiny24_diy.upload.maximum_data_size=128

# Version Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

attiny24_diy.menu.version.attiny24 = ATtiny24
attiny24_diy.menu.version.attiny24.build.mcu = attiny24

attiny24_diy.menu.version.attiny24a = ATtiny24a
attiny24_diy.menu.version.attiny24a.build.mcu  = attiny24
# TODO: Fix avrdude.conf so we can specify attiny24a, avr-gcc knows about it
#       but avrdude doesn't.

# Bootloader Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

attiny24_diy.menu.boot.optiboot=Yes (Normal Arduino Serial/USB Upload)
attiny24_diy.menu.boot.optiboot.upload.protocol=arduino
attiny24_diy.menu.boot.optiboot.upload.maximum_size=1490
attiny24_diy.menu.boot.optiboot.bootloader.extended_fuses=0xFE
attiny24_diy.menu.boot.optiboot.bootloader.file=optiboot_{build.mcu}_{build.f_cpu}_{upload.speed}.hex

attiny24_diy.menu.boot.optiboot_notune=Yes, Without Tuner
attiny24_diy.menu.boot.optiboot_notune.upload.protocol=arduino
attiny24_diy.menu.boot.optiboot_notune.upload.maximum_size=1504
attiny24_diy.menu.boot.optiboot_notune.bootloader.extended_fuses=0xFE
attiny24_diy.menu.boot.optiboot_notune.bootloader.file=notuner_optiboot_{build.mcu}_{build.f_cpu}_{upload.speed}.hex

attiny24_diy.menu.boot.none=No (ISP Programmer Upload)
attiny24_diy.menu.boot.none.upload.maximum_size=2048
attiny24_diy.menu.boot.none.bootloader.tool=diy_attiny:avrdude_nobootloader

# Speed Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

attiny24_diy.menu.clock.8MHz=8MHz Internal Oscillator
attiny24_diy.menu.clock.8MHz.build.f_cpu=8000000L
attiny24_diy.menu.clock.8MHz.bootloader.low_fuses=0xE2

attiny24_diy.menu.clock.16MHz=16MHz Crystal/Resonator
attiny24_diy.menu.clock.16MHz.build.f_cpu=16000000L
attiny24_diy.menu.clock.16MHz.bootloader.low_fuses=0xFF

attiny24_diy.menu.clock.1MHz=1MHz Internal Oscillator
attiny24_diy.menu.clock.1MHz.build.f_cpu=1000000L
attiny24_diy.menu.clock.1MHz.bootloader.low_fuses=0x62
attiny24_diy.menu.clock.1MHz.upload.speed=9600

# Core Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
attiny24_diy.menu.core.SmallerCore=Millis Available, No Tone
attiny24_diy.menu.core.SmallerCore.build.variant=tinyX4
attiny24_diy.menu.core.SmallerCore.build.core=tiny
attiny24_diy.menu.core.SmallerCore.build.extra_flags=-DNO_TONE

attiny24_diy.menu.core.FullCore=Millis and Tone Available
attiny24_diy.menu.core.FullCore.build.variant=tinyX4
attiny24_diy.menu.core.FullCore.build.core=tiny
attiny24_diy.menu.core.FullCore.build.extra_flags=

attiny24_diy.menu.core.SmallestCore=No Millis, No Tone
attiny24_diy.menu.core.SmallestCore.build.variant=tinyX4
attiny24_diy.menu.core.SmallestCore.build.core=tiny
attiny24_diy.menu.core.SmallestCore.build.extra_flags=-DNO_MILLIS -DNO_TONE

# Print Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
attiny24_diy.menu.print.BinHexDec=Bin, Hex, Dec Supported
attiny24_diy.menu.print.BinHexDec.build.custom_flags.print.use_base=-DPRINT_USE_BASE_BIN -DPRINT_USE_BASE_DEC -DPRINT_USE_BASE_HEX

