sleemanj/optiboot/dists/diy_attiny/avr/boards.txt
attiny24_diy.menu.print.Arbitrary=Full Support For Arbitrary Bases (Biggest)
attiny24_diy.menu.print.Arbitrary.build.custom_flags.print.use_base=-DPRINT_USE_BASE_ARBITRARY

attiny24_diy.menu.print.BinHexDecOct=Bin, Hex, Dec, Oct Supported
attiny24_diy.menu.print.BinHexDecOct.build.custom_flags.print.use_base=-DPRINT_USE_BASE_BIN -DPRINT_USE_BASE_DEC -DPRINT_USE_BASE_HEX -DPRINT_USE_BASE_OCT

attiny24_diy.menu.print.Dec=Dec Only Supported
attiny24_diy.menu.print.Dec.build.custom_flags.print.use_base=-DPRINT_USE_BASE_DEC

attiny24_diy.menu.print.Hex=Hex Only Supported
attiny24_diy.menu.print.Hex.build.custom_flags.print.use_base=-DPRINT_USE_BASE_HEX

attiny24_diy.menu.print.Oct=Oct Only Supported
attiny24_diy.menu.print.Oct.build.custom_flags.print.use_base=-DPRINT_USE_BASE_OCT

attiny24_diy.menu.print.Bin=Bin Only Supported (Smallest)
attiny24_diy.menu.print.Bin.build.custom_flags.print.use_base=-DPRINT_USE_BASE_BIN


# Millis Accuracy
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
attiny24_diy.menu.millis_ppm.1p6=Better Or Equal 1.666% Error (Default)
attiny24_diy.menu.millis_ppm.1p6.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=16666UL

attiny24_diy.menu.millis_ppm.50p=Better Or Equal 50% Error (Lowest Code Use)
attiny24_diy.menu.millis_ppm.50p.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=500000UL

attiny24_diy.menu.millis_ppm.25p=Better Or Equal 25% Error
attiny24_diy.menu.millis_ppm.25p.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=250000UL

attiny24_diy.menu.millis_ppm.10p=Better Or Equal 10% Error
attiny24_diy.menu.millis_ppm.10p.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=100000UL

attiny24_diy.menu.millis_ppm.5p=Better Or Equal 5% Error
attiny24_diy.menu.millis_ppm.5p.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=50000UL

attiny24_diy.menu.millis_ppm.2p5=Better Or Equal 2.5% Error
attiny24_diy.menu.millis_ppm.2p5.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=25000UL

attiny24_diy.menu.millis_ppm.1p=Better Or Equal 1% Error
attiny24_diy.menu.millis_ppm.1p.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=10000UL

attiny24_diy.menu.millis_ppm.0p5=Better Or Equal 0.5% Error
attiny24_diy.menu.millis_ppm.0p5.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=5000UL

attiny24_diy.menu.millis_ppm.0p25=Better Or Equal 0.25% Error
attiny24_diy.menu.millis_ppm.0p25.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=2500UL

attiny24_diy.menu.millis_ppm.0p1=Better Or Equal 0.1% Error (Highest Code Use)
attiny24_diy.menu.millis_ppm.0p1.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=1000UL

# Link Time Optimisation
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
attiny24_diy.menu.lto.enable=LTO Enabled
attiny24_diy.menu.lto.enable.ltocflags=-flto -DLTO_ENABLED -fno-fat-lto-objects
attiny24_diy.menu.lto.enable.ltoelfflags=-g -flto -DLTO_ENABLED -fuse-linker-plugin
attiny24_diy.menu.lto.enable.ltocppflags=-flto -DLTO_ENABLED
attiny24_diy.menu.lto.enable.ltoarcmd=gcc-
attiny24_diy.menu.lto.disable=LTO Disabled
attiny24_diy.menu.lto.disable.ltocflags=
attiny24_diy.menu.lto.disable.ltoelfflags=
attiny24_diy.menu.lto.disable.ltocppflags=
attiny24_diy.menu.lto.disable.ltoarcmd=

# BOD Level Fuse Bits
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
attiny24_diy.menu.bodlevel.2v7=2.7v
attiny24_diy.menu.bodlevel.2v7.bootloader.bod_bits=101
attiny24_diy.menu.bodlevel.disabled=Disabled
attiny24_diy.menu.bodlevel.disabled.bootloader.bod_bits=111
attiny24_diy.menu.bodlevel.4v3=4.3v
attiny24_diy.menu.bodlevel.4v3.bootloader.bod_bits=100
attiny24_diy.menu.bodlevel.1v8=1.8v
attiny24_diy.menu.bodlevel.1v8.bootloader.bod_bits=110

# The ones below are not mentioned in the 24/44/84 or 24/44/84A 
# datasheets but at least engbedded includes for 24A/44[A]/84
# so they might work, but can't say for sure.
#
# attiny24_diy.menu.bodlevel.2v3=2.3v
# attiny24_diy.menu.bodlevel.2v3.bootloader.bod_bits=011
# attiny24_diy.menu.bodlevel.2v2=2.2v
# attiny24_diy.menu.bodlevel.2v2.bootloader.bod_bits=010
# attiny24_diy.menu.bodlevel.2v0=2.0v
# attiny24_diy.menu.bodlevel.2v0.bootloader.bod_bits=000
# attiny24_diy.menu.bodlevel.1v9=1.9v
# attiny24_diy.menu.bodlevel.1v9.bootloader.bod_bits=001


# }}}

# {{{ ############### ATtiny44 #################################################

attiny44_diy.name=ATtiny44
attiny44_diy.build.mcu=attiny44
attiny44_diy.bootloader.low_fuses=0xE2
# attiny44_diy.bootloader.high_fuses=0xDD
attiny44_diy.bootloader.bod_bits=101
attiny44_diy.bootloader.high_fuses=0b11011{bootloader.bod_bits}
attiny44_diy.bootloader.extended_fuses=0xFF
attiny44_diy.bootloader.unlock_bits=0xFF
attiny44_diy.bootloader.lock_bits=0xFF
attiny44_diy.build.f_cpu=8000000L
attiny44_diy.upload.speed=57600
attiny44_diy.build.core=tiny
attiny44_diy.build.variant=tiny8
attiny44_diy.build.board=ATTINY44_DIY
attiny44_diy.upload.tool=diy_attiny:avrdude
attiny44_diy.bootloader.tool=diy_attiny:avrdude
attiny44_diy.upload.maximum_data_size=256

# Version Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

attiny44_diy.menu.version.attiny44 = ATtiny44
attiny44_diy.menu.version.attiny44.build.mcu = attiny44

attiny44_diy.menu.version.attiny44a = ATtiny44a
attiny44_diy.menu.version.attiny44a.build.mcu  = attiny44
# TODO: Fix avrdude.conf so we can specify attiny44a, avr-gcc knows about it
#       but avrdude doesn't.

# Bootloader Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

attiny44_diy.menu.boot.optiboot=Yes (Normal Arduino Serial/USB Upload)
attiny44_diy.menu.boot.optiboot.upload.protocol=arduino
attiny44_diy.menu.boot.optiboot.upload.maximum_size=3538
attiny44_diy.menu.boot.optiboot.bootloader.extended_fuses=0xFE
attiny44_diy.menu.boot.optiboot.bootloader.file=optiboot_{build.mcu}_{build.f_cpu}_{upload.speed}.hex

attiny44_diy.menu.boot.optiboot_notune=Yes, Without Tuner
attiny44_diy.menu.boot.optiboot_notune.upload.protocol=arduino
attiny44_diy.menu.boot.optiboot_notune.upload.maximum_size=3552
attiny44_diy.menu.boot.optiboot_notune.bootloader.extended_fuses=0xFE
attiny44_diy.menu.boot.optiboot_notune.bootloader.file=notuner_optiboot_{build.mcu}_{build.f_cpu}_{upload.speed}.hex

attiny44_diy.menu.boot.none=No (ISP Programmer Upload)
attiny44_diy.menu.boot.none.upload.maximum_size=4096
attiny44_diy.menu.boot.none.bootloader.tool=diy_attiny:avrdude_nobootloader

# Speed Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

attiny44_diy.menu.clock.8MHz=8MHz Internal Oscillator
attiny44_diy.menu.clock.8MHz.build.f_cpu=8000000L
attiny44_diy.menu.clock.8MHz.bootloader.low_fuses=0xE2

