sleemanj/optiboot/dists/diy_attiny/avr/boards.txt
attiny44_diy.menu.clock.16MHz=16MHz Crystal/Resonator
attiny44_diy.menu.clock.16MHz.build.f_cpu=16000000L
attiny44_diy.menu.clock.16MHz.bootloader.low_fuses=0xFF

attiny44_diy.menu.clock.1MHz=1MHz Internal Oscillator
attiny44_diy.menu.clock.1MHz.build.f_cpu=1000000L
attiny44_diy.menu.clock.1MHz.bootloader.low_fuses=0x62
attiny44_diy.menu.clock.1MHz.upload.speed=9600

# Core Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
attiny44_diy.menu.core.SmallerCore=Millis Available, No Tone
attiny44_diy.menu.core.SmallerCore.build.variant=tinyX4
attiny44_diy.menu.core.SmallerCore.build.core=tiny
attiny44_diy.menu.core.SmallerCore.build.extra_flags=-DNO_TONE

attiny44_diy.menu.core.FullCore=Millis and Tone Available
attiny44_diy.menu.core.FullCore.build.variant=tinyX4
attiny44_diy.menu.core.FullCore.build.core=tiny
attiny44_diy.menu.core.FullCore.build.extra_flags=

attiny44_diy.menu.core.SmallestCore=No Millis, No Tone
attiny44_diy.menu.core.SmallestCore.build.variant=tinyX4
attiny44_diy.menu.core.SmallestCore.build.core=tiny
attiny44_diy.menu.core.SmallestCore.build.extra_flags=-DNO_MILLIS -DNO_TONE

# Print Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
attiny44_diy.menu.print.BinHexDec=Bin, Hex, Dec Supported
attiny44_diy.menu.print.BinHexDec.build.custom_flags.print.use_base=-DPRINT_USE_BASE_BIN -DPRINT_USE_BASE_DEC -DPRINT_USE_BASE_HEX

attiny44_diy.menu.print.Arbitrary=Full Support For Arbitrary Bases (Biggest)
attiny44_diy.menu.print.Arbitrary.build.custom_flags.print.use_base=-DPRINT_USE_BASE_ARBITRARY

attiny44_diy.menu.print.BinHexDecOct=Bin, Hex, Dec, Oct Supported
attiny44_diy.menu.print.BinHexDecOct.build.custom_flags.print.use_base=-DPRINT_USE_BASE_BIN -DPRINT_USE_BASE_DEC -DPRINT_USE_BASE_HEX -DPRINT_USE_BASE_OCT

attiny44_diy.menu.print.Dec=Dec Only Supported
attiny44_diy.menu.print.Dec.build.custom_flags.print.use_base=-DPRINT_USE_BASE_DEC

attiny44_diy.menu.print.Hex=Hex Only Supported
attiny44_diy.menu.print.Hex.build.custom_flags.print.use_base=-DPRINT_USE_BASE_HEX

attiny44_diy.menu.print.Oct=Oct Only Supported
attiny44_diy.menu.print.Oct.build.custom_flags.print.use_base=-DPRINT_USE_BASE_OCT

attiny44_diy.menu.print.Bin=Bin Only Supported (Smallest)
attiny44_diy.menu.print.Bin.build.custom_flags.print.use_base=-DPRINT_USE_BASE_BIN

# Millis Accuracy
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
attiny44_diy.menu.millis_ppm.1p6=Better Or Equal 1.666% Error (Default)
attiny44_diy.menu.millis_ppm.1p6.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=16666UL

attiny44_diy.menu.millis_ppm.50p=Better Or Equal 50% Error (Lowest Code Use)
attiny44_diy.menu.millis_ppm.50p.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=500000UL

attiny44_diy.menu.millis_ppm.25p=Better Or Equal 25% Error
attiny44_diy.menu.millis_ppm.25p.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=250000UL

attiny44_diy.menu.millis_ppm.10p=Better Or Equal 10% Error
attiny44_diy.menu.millis_ppm.10p.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=100000UL

attiny44_diy.menu.millis_ppm.5p=Better Or Equal 5% Error
attiny44_diy.menu.millis_ppm.5p.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=50000UL

attiny44_diy.menu.millis_ppm.2p5=Better Or Equal 2.5% Error
attiny44_diy.menu.millis_ppm.2p5.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=25000UL

attiny44_diy.menu.millis_ppm.1p=Better Or Equal 1% Error
attiny44_diy.menu.millis_ppm.1p.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=10000UL

attiny44_diy.menu.millis_ppm.0p5=Better Or Equal 0.5% Error
attiny44_diy.menu.millis_ppm.0p5.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=5000UL

attiny44_diy.menu.millis_ppm.0p25=Better Or Equal 0.25% Error
attiny44_diy.menu.millis_ppm.0p25.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=2500UL

attiny44_diy.menu.millis_ppm.0p1=Better Or Equal 0.1% Error (Highest Code Use)
attiny44_diy.menu.millis_ppm.0p1.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=1000UL

# Link Time Optimisation
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
attiny44_diy.menu.lto.enable=LTO Enabled
attiny44_diy.menu.lto.enable.ltocflags=-flto -DLTO_ENABLED -fno-fat-lto-objects
attiny44_diy.menu.lto.enable.ltoelfflags=-g -flto -DLTO_ENABLED -fuse-linker-plugin
attiny44_diy.menu.lto.enable.ltocppflags=-flto -DLTO_ENABLED
attiny44_diy.menu.lto.enable.ltoarcmd=gcc-
attiny44_diy.menu.lto.disable=LTO Disabled
attiny44_diy.menu.lto.disable.ltocflags=
attiny44_diy.menu.lto.disable.ltoelfflags=
attiny44_diy.menu.lto.disable.ltocppflags=
attiny44_diy.menu.lto.disable.ltoarcmd=

# BOD Level Fuse Bits
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
attiny44_diy.menu.bodlevel.2v7=2.7v
attiny44_diy.menu.bodlevel.2v7.bootloader.bod_bits=101
attiny44_diy.menu.bodlevel.disabled=Disabled
attiny44_diy.menu.bodlevel.disabled.bootloader.bod_bits=111
attiny44_diy.menu.bodlevel.4v3=4.3v
attiny44_diy.menu.bodlevel.4v3.bootloader.bod_bits=100
attiny44_diy.menu.bodlevel.1v8=1.8v
attiny44_diy.menu.bodlevel.1v8.bootloader.bod_bits=110

# The ones below are not mentioned in the 24/44/84 or 24/44/84A 
# datasheets but at least engbedded includes for 24A/44[A]/84
# so they might work, but can't say for sure.
#
# attiny44_diy.menu.bodlevel.2v3=2.3v
# attiny44_diy.menu.bodlevel.2v3.bootloader.bod_bits=011
# attiny44_diy.menu.bodlevel.2v2=2.2v
# attiny44_diy.menu.bodlevel.2v2.bootloader.bod_bits=010
# attiny44_diy.menu.bodlevel.2v0=2.0v
# attiny44_diy.menu.bodlevel.2v0.bootloader.bod_bits=000
# attiny44_diy.menu.bodlevel.1v9=1.9v
# attiny44_diy.menu.bodlevel.1v9.bootloader.bod_bits=001


# }}}

# {{{ ############### ATtiny84 #################################################

attiny84_diy.name=ATtiny84
attiny84_diy.build.mcu=attiny84
attiny84_diy.bootloader.low_fuses=0xE2
# attiny84_diy.bootloader.high_fuses=0xDD
attiny84_diy.bootloader.bod_bits=101
attiny84_diy.bootloader.high_fuses=0b11011{bootloader.bod_bits}
attiny84_diy.bootloader.extended_fuses=0xFF
attiny84_diy.bootloader.unlock_bits=0xFF
attiny84_diy.bootloader.lock_bits=0xFF
attiny84_diy.build.f_cpu=8000000L
attiny84_diy.upload.speed=57600
attiny84_diy.build.core=tiny
attiny84_diy.build.variant=tiny8
attiny84_diy.build.board=ATTINY84_DIY
attiny84_diy.upload.tool=diy_attiny:avrdude
attiny84_diy.bootloader.tool=diy_attiny:avrdude
attiny84_diy.upload.maximum_data_size=512

# Version Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

attiny84_diy.menu.version.attiny84 = ATtiny84
attiny84_diy.menu.version.attiny84.build.mcu = attiny84

