sleemanj/optiboot/dists/diy_attiny/avr/boards.txt
attiny84_diy.menu.version.attiny84a = ATtiny84a
attiny84_diy.menu.version.attiny84a.build.mcu  = attiny84
# TODO: Fix avrdude.conf so we can specify attiny84a, avr-gcc knows about it
#       but avrdude doesn't.  Actually, avr-gcc in 1.6.x IDE does, not in 1.0.x

# Bootloader Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

attiny84_diy.menu.boot.optiboot=Yes (Normal Arduino Serial/USB Upload)
attiny84_diy.menu.boot.optiboot.upload.protocol=arduino
attiny84_diy.menu.boot.optiboot.upload.maximum_size=7622
attiny84_diy.menu.boot.optiboot.bootloader.extended_fuses=0xFE
attiny84_diy.menu.boot.optiboot.bootloader.file=optiboot_{build.mcu}_{build.f_cpu}_{upload.speed}.hex

# @NOTE - The Tiny84 has 7622 avail with tuner, the Tiny84A has 7634 avail with tuner
#         unfortunately we can't easily distinguish the version here in the bootloader
#         so I have selected the lowest so 12 bytes are wasted on the 84a
#
#         The build.mcu specified above is always attiny84 currently anyway.

attiny84_diy.menu.boot.optiboot_notune=Yes, Without Tuner
attiny84_diy.menu.boot.optiboot_notune.upload.protocol=arduino
attiny84_diy.menu.boot.optiboot_notune.upload.maximum_size=7648
attiny84_diy.menu.boot.optiboot_notune.bootloader.extended_fuses=0xFE
attiny84_diy.menu.boot.optiboot_notune.bootloader.file=notuner_optiboot_{build.mcu}_{build.f_cpu}_{upload.speed}.hex

attiny84_diy.menu.boot.none=No (ISP Programmer Upload)
attiny84_diy.menu.boot.none.upload.maximum_size=8192
attiny84_diy.menu.boot.none.bootloader.tool=diy_attiny:avrdude_nobootloader

# Speed Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

attiny84_diy.menu.clock.8MHz=8MHz Internal Oscillator
attiny84_diy.menu.clock.8MHz.build.f_cpu=8000000L
attiny84_diy.menu.clock.8MHz.bootloader.low_fuses=0xE2

attiny84_diy.menu.clock.16MHz=16MHz Crystal/Resonator
attiny84_diy.menu.clock.16MHz.build.f_cpu=16000000L
attiny84_diy.menu.clock.16MHz.bootloader.low_fuses=0xFF

attiny84_diy.menu.clock.1MHz=1MHz Internal Oscillator
attiny84_diy.menu.clock.1MHz.build.f_cpu=1000000L
attiny84_diy.menu.clock.1MHz.bootloader.low_fuses=0x62
attiny84_diy.menu.clock.1MHz.upload.speed=9600

# Core Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
attiny84_diy.menu.core.FullCore=Millis and Tone Available
attiny84_diy.menu.core.FullCore.build.variant=tinyX4
attiny84_diy.menu.core.FullCore.build.core=tiny
attiny84_diy.menu.core.FullCore.build.extra_flags=

attiny84_diy.menu.core.SmallerCore=Millis Available, No Tone
attiny84_diy.menu.core.SmallerCore.build.variant=tinyX4
attiny84_diy.menu.core.SmallerCore.build.core=tiny
attiny84_diy.menu.core.SmallerCore.build.extra_flags=-DNO_TONE

attiny84_diy.menu.core.SmallestCore=No Millis, No Tone
attiny84_diy.menu.core.SmallestCore.build.variant=tinyX4
attiny84_diy.menu.core.SmallestCore.build.core=tiny
attiny84_diy.menu.core.SmallestCore.build.extra_flags=-DNO_MILLIS -DNO_TONE

# Print Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
attiny84_diy.menu.print.BinHexDec=Bin, Hex, Dec Supported
attiny84_diy.menu.print.BinHexDec.build.custom_flags.print.use_base=-DPRINT_USE_BASE_BIN -DPRINT_USE_BASE_DEC -DPRINT_USE_BASE_HEX

attiny84_diy.menu.print.Arbitrary=Full Support For Arbitrary Bases (Biggest)
attiny84_diy.menu.print.Arbitrary.build.custom_flags.print.use_base=-DPRINT_USE_BASE_ARBITRARY

attiny84_diy.menu.print.BinHexDecOct=Bin, Hex, Dec, Oct Supported
attiny84_diy.menu.print.BinHexDecOct.build.custom_flags.print.use_base=-DPRINT_USE_BASE_BIN -DPRINT_USE_BASE_DEC -DPRINT_USE_BASE_HEX -DPRINT_USE_BASE_OCT

attiny84_diy.menu.print.Dec=Dec Only Supported
attiny84_diy.menu.print.Dec.build.custom_flags.print.use_base=-DPRINT_USE_BASE_DEC

attiny84_diy.menu.print.Hex=Hex Only Supported
attiny84_diy.menu.print.Hex.build.custom_flags.print.use_base=-DPRINT_USE_BASE_HEX

attiny84_diy.menu.print.Oct=Oct Only Supported
attiny84_diy.menu.print.Oct.build.custom_flags.print.use_base=-DPRINT_USE_BASE_OCT

attiny84_diy.menu.print.Bin=Bin Only Supported (Smallest)
attiny84_diy.menu.print.Bin.build.custom_flags.print.use_base=-DPRINT_USE_BASE_BIN

# Millis Accuracy
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
attiny84_diy.menu.millis_ppm.1p6=Better Or Equal 1.666% Error (Default)
attiny84_diy.menu.millis_ppm.1p6.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=16666UL

attiny84_diy.menu.millis_ppm.50p=Better Or Equal 50% Error (Lowest Code Use)
attiny84_diy.menu.millis_ppm.50p.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=500000UL

attiny84_diy.menu.millis_ppm.25p=Better Or Equal 25% Error
attiny84_diy.menu.millis_ppm.25p.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=250000UL

attiny84_diy.menu.millis_ppm.10p=Better Or Equal 10% Error
attiny84_diy.menu.millis_ppm.10p.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=100000UL

attiny84_diy.menu.millis_ppm.5p=Better Or Equal 5% Error
attiny84_diy.menu.millis_ppm.5p.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=50000UL

attiny84_diy.menu.millis_ppm.2p5=Better Or Equal 2.5% Error
attiny84_diy.menu.millis_ppm.2p5.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=25000UL

attiny84_diy.menu.millis_ppm.1p=Better Or Equal 1% Error
attiny84_diy.menu.millis_ppm.1p.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=10000UL

attiny84_diy.menu.millis_ppm.0p5=Better Or Equal 0.5% Error
attiny84_diy.menu.millis_ppm.0p5.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=5000UL

attiny84_diy.menu.millis_ppm.0p25=Better Or Equal 0.25% Error
attiny84_diy.menu.millis_ppm.0p25.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=2500UL

attiny84_diy.menu.millis_ppm.0p1=Better Or Equal 0.1% Error (Highest Code Use)
attiny84_diy.menu.millis_ppm.0p1.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=1000UL

# Link Time Optimisation
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
attiny84_diy.menu.lto.enable=LTO Enabled
attiny84_diy.menu.lto.enable.ltocflags=-flto -DLTO_ENABLED -fno-fat-lto-objects
attiny84_diy.menu.lto.enable.ltoelfflags=-g -flto -DLTO_ENABLED -fuse-linker-plugin
attiny84_diy.menu.lto.enable.ltocppflags=-flto -DLTO_ENABLED
attiny84_diy.menu.lto.enable.ltoarcmd=gcc-
attiny84_diy.menu.lto.disable=LTO Disabled
attiny84_diy.menu.lto.disable.ltocflags=
attiny84_diy.menu.lto.disable.ltoelfflags=
attiny84_diy.menu.lto.disable.ltocppflags=
attiny84_diy.menu.lto.disable.ltoarcmd=

