sleemanj/optiboot/dists/diy_attiny/avr/boards.txt
# BOD Level Fuse Bits
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
attiny84_diy.menu.bodlevel.2v7=2.7v
attiny84_diy.menu.bodlevel.2v7.bootloader.bod_bits=101
attiny84_diy.menu.bodlevel.disabled=Disabled
attiny84_diy.menu.bodlevel.disabled.bootloader.bod_bits=111
attiny84_diy.menu.bodlevel.4v3=4.3v
attiny84_diy.menu.bodlevel.4v3.bootloader.bod_bits=100
attiny84_diy.menu.bodlevel.1v8=1.8v
attiny84_diy.menu.bodlevel.1v8.bootloader.bod_bits=110

# The ones below are not mentioned in the 24/44/84 or 24/44/84A 
# datasheets but at least engbedded includes for 24A/44[A]/84
# so they might work, but can't say for sure.
#
# attiny84_diy.menu.bodlevel.2v3=2.3v
# attiny84_diy.menu.bodlevel.2v3.bootloader.bod_bits=011
# attiny84_diy.menu.bodlevel.2v2=2.2v
# attiny84_diy.menu.bodlevel.2v2.bootloader.bod_bits=010
# attiny84_diy.menu.bodlevel.2v0=2.0v
# attiny84_diy.menu.bodlevel.2v0.bootloader.bod_bits=000
# attiny84_diy.menu.bodlevel.1v9=1.9v
# attiny84_diy.menu.bodlevel.1v9.bootloader.bod_bits=001

# }}}












################################################################################
# ATtiny13/A
#
# Note, there is no bootloader section, so we can not do any locking.
#
# Lock Bits Note
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
#  avrdude DOES mask the two high bits of the lock byte on the 13, therefore
#
#    0x3F = No Locking
#    0x3E = Read Locking
#    0x3C = Read and Write Locking
#
# Extended Fuses Note
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
#  avrdude DOES NOT mask the L/H fuses on the 13
#
#
################################################################################

# {{{ ############### ATtiny13 #################################################

attiny13_diy.name=ATtiny13
attiny13_diy.build.mcu=attiny13
attiny13_diy.bootloader.low_fuses=0x7A
# attiny13_diy.bootloader.high_fuses=0xFB
attiny13_diy.bootloader.high_fuses=0b11111{bootloader.bod_bits}1
attiny13_diy.bootloader.bod_bits=01
attiny13_diy.bootloader.unlock_bits=0x3F
attiny13_diy.bootloader.lock_bits=0x3F
attiny13_diy.build.f_cpu=9600000L
attiny13_diy.upload.speed=57600
attiny13_diy.build.core=tiny
attiny13_diy.build.variant=tiny13
attiny13_diy.build.board=ATTINY13_DIY
attiny13_diy.upload.tool=diy_attiny:avrdude_nobootloader_noefuse
attiny13_diy.program.tool=diy_attiny:avrdude_nobootloader_noefuse
attiny13_diy.bootloader.tool=diy_attiny:avrdude_nobootloader_noefuse
attiny13_diy.upload.maximum_data_size=64

# Version Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

attiny13_diy.menu.version.attiny13 = ATtiny13
attiny13_diy.menu.version.attiny13.build.mcu = attiny13

attiny13_diy.menu.version.attiny13a = ATtiny13a
attiny13_diy.menu.version.attiny13a.build.mcu  = attiny13

# Bootloader Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

# Sorry attiny13, you're too small for bootloaders.
#
# attiny13_diy.menu.boot.optiboot=Yes (Normal Arduino Serial/USB Upload)
# attiny13_diy.menu.boot.optiboot.upload.protocol=arduino
# attiny13_diy.menu.boot.optiboot.upload.maximum_size=457
# attiny13_diy.menu.boot.optiboot.bootloader.extended_fuses=0xEB
# attiny13_diy.menu.boot.optiboot.bootloader.file=optiboot_{build.mcu}_{build.f_cpu}_{upload.speed}.hex

attiny13_diy.menu.boot.none=No (ISP Programmer Upload)
attiny13_diy.menu.boot.none.upload.maximum_size=1024
attiny13_diy.menu.boot.none.bootloader.tool=diy_attiny:avrdude_nobootloader_noefuse

attiny13_diy.menu.boot.macfix=No (ISP Programmer Upload) (NullPointer Fix?)
attiny13_diy.menu.boot.macfix.upload.maximum_size=1024
attiny13_diy.menu.boot.macfix.bootloader.tool=diy_attiny:avrdude_nobootloader_noefuse
attiny13_diy.menu.boot.macfix.upload.tool=avrdude


# Speed Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

attiny13_diy.menu.clock.9_6MHz=9.6MHz Internal Oscillator
attiny13_diy.menu.clock.9_6MHz.build.f_cpu=9600000L
attiny13_diy.menu.clock.9_6MHz.bootloader.low_fuses=0x7A

attiny13_diy.menu.clock.4_8MHz=4.8MHz Internal Oscillator
attiny13_diy.menu.clock.4_8MHz.build.f_cpu=4800000L
attiny13_diy.menu.clock.4_8MHz.bootloader.low_fuses=0x79

attiny13_diy.menu.clock.1_2MHz=1.2MHz Internal Oscillator
attiny13_diy.menu.clock.1_2MHz.build.f_cpu=1200000L
attiny13_diy.menu.clock.1_2MHz.bootloader.low_fuses=0x62


# Core Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

attiny13_diy.menu.core.MillisCore=Millis Available, No Tone
attiny13_diy.menu.core.MillisCore.build.variant=tiny13
attiny13_diy.menu.core.MillisCore.build.core=tiny
attiny13_diy.menu.core.MillisCore.build.extra_flags=-DNO_TONE

attiny13_diy.menu.core.ToneCore=Tone Available, No Millis
attiny13_diy.menu.core.ToneCore.build.variant=tiny13
attiny13_diy.menu.core.ToneCore.build.core=tiny
attiny13_diy.menu.core.ToneCore.build.extra_flags=-DNO_MILLIS

attiny13_diy.menu.core.SmallestCore=No Millis, No Tone
attiny13_diy.menu.core.SmallestCore.build.variant=tiny13
attiny13_diy.menu.core.SmallestCore.build.core=tiny
attiny13_diy.menu.core.SmallestCore.build.extra_flags=-DNO_MILLIS -DNO_TONE

attiny13_diy.menu.core.FullCore=Millis and Tone Available
attiny13_diy.menu.core.FullCore.build.variant=tiny13
attiny13_diy.menu.core.FullCore.build.core=tiny
attiny13_diy.menu.core.FullCore.build.extra_flags=


# Millis Accuracy
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
attiny13_diy.menu.millis_ppm.1p6=Better Or Equal 1.666% Error (Default)
attiny13_diy.menu.millis_ppm.1p6.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=16666UL

attiny13_diy.menu.millis_ppm.50p=Better Or Equal 50% Error (Lowest Code Use)
attiny13_diy.menu.millis_ppm.50p.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=500000UL

attiny13_diy.menu.millis_ppm.25p=Better Or Equal 25% Error
attiny13_diy.menu.millis_ppm.25p.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=250000UL

attiny13_diy.menu.millis_ppm.10p=Better Or Equal 10% Error
attiny13_diy.menu.millis_ppm.10p.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=100000UL

attiny13_diy.menu.millis_ppm.5p=Better Or Equal 5% Error
attiny13_diy.menu.millis_ppm.5p.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=50000UL

attiny13_diy.menu.millis_ppm.2p5=Better Or Equal 2.5% Error
attiny13_diy.menu.millis_ppm.2p5.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=25000UL

