sleemanj/optiboot/dists/diy_attiny/avr/boards.txt
attiny13_diy.menu.millis_ppm.1p=Better Or Equal 1% Error
attiny13_diy.menu.millis_ppm.1p.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=10000UL

attiny13_diy.menu.millis_ppm.0p5=Better Or Equal 0.5% Error
attiny13_diy.menu.millis_ppm.0p5.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=5000UL

attiny13_diy.menu.millis_ppm.0p25=Better Or Equal 0.25% Error
attiny13_diy.menu.millis_ppm.0p25.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=2500UL

attiny13_diy.menu.millis_ppm.0p1=Better Or Equal 0.1% Error (Highest Code Use)
attiny13_diy.menu.millis_ppm.0p1.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=1000UL






# Print Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
attiny13_diy.menu.print.BinHexDec=Bin, Hex, Dec Supported
attiny13_diy.menu.print.BinHexDec.build.custom_flags.print.use_base=-DPRINT_USE_BASE_BIN -DPRINT_USE_BASE_DEC -DPRINT_USE_BASE_HEX

attiny13_diy.menu.print.Arbitrary=Full Support For Arbitrary Bases (Biggest)
attiny13_diy.menu.print.Arbitrary.build.custom_flags.print.use_base=-DPRINT_USE_BASE_ARBITRARY

attiny13_diy.menu.print.BinHexDecOct=Bin, Hex, Dec, Oct Supported
attiny13_diy.menu.print.BinHexDecOct.build.custom_flags.print.use_base=-DPRINT_USE_BASE_BIN -DPRINT_USE_BASE_DEC -DPRINT_USE_BASE_HEX -DPRINT_USE_BASE_OCT

attiny13_diy.menu.print.Dec=Dec Only Supported
attiny13_diy.menu.print.Dec.build.custom_flags.print.use_base=-DPRINT_USE_BASE_DEC

attiny13_diy.menu.print.Hex=Hex Only Supported
attiny13_diy.menu.print.Hex.build.custom_flags.print.use_base=-DPRINT_USE_BASE_HEX

attiny13_diy.menu.print.Oct=Oct Only Supported
attiny13_diy.menu.print.Oct.build.custom_flags.print.use_base=-DPRINT_USE_BASE_OCT

attiny13_diy.menu.print.Bin=Bin Only Supported (Smallest)
attiny13_diy.menu.print.Bin.build.custom_flags.print.use_base=-DPRINT_USE_BASE_BIN

# Serial Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
attiny13_diy.menu.serial.HalfDuplexRW=Half Duplex, Read+Write
attiny13_diy.menu.serial.HalfDuplexRW.build.custom_flags.serial.use_serial_type=-DUSE_SERIAL_TYPE=SERIAL_TYPE_HALF_DUPLEX

attiny13_diy.menu.serial.HalfDuplexRWStream=Half Duplex, Read+Write Inherits Stream
attiny13_diy.menu.serial.HalfDuplexRWStream.build.custom_flags.serial.use_serial_type=-DUSE_SERIAL_TYPE=SERIAL_TYPE_HALF_DUPLEX -DHALFDUPLEXSERIAL_INHERIT_FROM=Stream

attiny13_diy.menu.serial.HalfDuplexRStream=Half Duplex, Read Only Inherits Stream
attiny13_diy.menu.serial.HalfDuplexRStream.build.custom_flags.serial.use_serial_type=-DUSE_SERIAL_TYPE=SERIAL_TYPE_HALF_DUPLEX -DHALF_DUPLEX_SERIAL_DISABLE_WRITE -DHALFDUPLEXSERIAL_INHERIT_FROM=Stream

attiny13_diy.menu.serial.HalfDuplexWStream=Half Duplex, Write Only Inherits Stream
attiny13_diy.menu.serial.HalfDuplexWStream.build.custom_flags.serial.use_serial_type=-DUSE_SERIAL_TYPE=SERIAL_TYPE_HALF_DUPLEX -DHALF_DUPLEX_SERIAL_DISABLE_READ

# Link Time Optimisation
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
attiny13_diy.menu.lto.enable=LTO Enabled
attiny13_diy.menu.lto.enable.ltocflags=-flto -DLTO_ENABLED -fno-fat-lto-objects
attiny13_diy.menu.lto.enable.ltoelfflags=-g -flto -DLTO_ENABLED -fuse-linker-plugin
attiny13_diy.menu.lto.enable.ltocppflags=-flto -DLTO_ENABLED
attiny13_diy.menu.lto.enable.ltoarcmd=gcc-
attiny13_diy.menu.lto.disable=LTO Disabled
attiny13_diy.menu.lto.disable.ltocflags=
attiny13_diy.menu.lto.disable.ltoelfflags=
attiny13_diy.menu.lto.disable.ltocppflags=
attiny13_diy.menu.lto.disable.ltoarcmd=

# BOD Level Fuse Bits
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
attiny13_diy.menu.bodlevel.2v7=2.7v
attiny13_diy.menu.bodlevel.2v7.bootloader.bod_bits=01
attiny13_diy.menu.bodlevel.disabled=Disabled
attiny13_diy.menu.bodlevel.disabled.bootloader.bod_bits=11
attiny13_diy.menu.bodlevel.1v8=1.8v
attiny13_diy.menu.bodlevel.1v8.bootloader.bod_bits=10
attiny13_diy.menu.bodlevel.4v3=4.3v
attiny13_diy.menu.bodlevel.4v3.bootloader.bod_bits=00

# }}}





################################################################################
# ATtiny4
#
# There is only 1 fuse on this series of chips, it really doesn't do much.
#
# Fuse
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
#  See page 154 of Datasheet
#
#   avrdude DOES NOT mask the fuse bits
#
#   0xFF = Default (Reset Enabled, WDT Not Always On, Clock Not Output)
#
# Lock Bits
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
#  See page 153 of Datasheet
#
#  avrdude DOES NOT mask the lock bits
#
#    0xFF = No Locking
#    0xFE = Write Locked
#    0xFC = Read and Write Locked
#
# Important: Lock bits must be set after setting the fuse.
#
################################################################################

# {{{ ############### ATtiny4 ##################################################

attiny4_diy.name=ATtiny4
attiny4_diy.build.mcu=attiny4
attiny4_diy.bootloader.fuse=0xFF
attiny4_diy.bootloader.unlock_bits=0xFF
attiny4_diy.bootloader.lock_bits=0xFF
attiny4_diy.build.f_cpu=8000000L
attiny4_diy.upload.speed=57600
attiny4_diy.build.core=tiny
attiny4_diy.build.variant=tiny4_9
attiny4_diy.build.board=ATTINY4_DIY
attiny4_diy.upload.tool=diy_attiny:avrdude_nobootloader_onefuse
attiny4_diy.bootloader.tool=diy_attiny:avrdude_nobootloader_onefuse
attiny4_diy.upload.maximum_data_size=32

# Version Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# Only one version, no sense including this menu
# attiny4_diy.menu.version.attiny4 = ATtiny4
# attiny4_diy.menu.version.attiny4.build.mcu = attiny4

# Speed Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# The frequency on the Reduced Core tinyAVR is set at runtime by way of a 
# prescaler (power of 2) on the internal 8MHz oscillator.
#
# See pins_arduino.h setCPUFrequency()

attiny4_diy.menu.clock.8MHz=8MHz
attiny4_diy.menu.clock.8MHz.build.f_cpu=8000000L

attiny4_diy.menu.clock.4MHz=4MHz
attiny4_diy.menu.clock.4MHz.build.f_cpu=4000000L

