sleemanj/optiboot/dists/diy_attiny/avr/boards.txt
# attiny9_diy.menu.clock.125kHz=125kHz
# attiny9_diy.menu.clock.125kHz.build.f_cpu=125000L


# Bootloader Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

# Sorry attiny9, you're too small for bootloaders.
#
# attiny9_diy.menu.boot.optiboot=Yes (Normal Arduino Serial/USB Upload)
# attiny9_diy.menu.boot.optiboot.upload.protocol=arduino
# attiny9_diy.menu.boot.optiboot.upload.maximum_size=457
# attiny9_diy.menu.boot.optiboot.bootloader.extended_fuses=0xEB
# attiny9_diy.menu.boot.optiboot.bootloader.file=optiboot_{build.mcu}_{build.f_cpu}_{upload.speed}.hex

attiny9_diy.menu.boot.none=No (TPI Programmer Upload)
attiny9_diy.menu.boot.none.upload.maximum_size=1024
attiny9_diy.menu.boot.none.bootloader.tool=diy_attiny:avrdude_nobootloader_onefuse

# Core Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
#attiny9_diy.menu.core.FullCore=Millis and Tone Available
#attiny9_diy.menu.core.FullCore.build.core=tiny
#attiny9_diy.menu.core.FullCore.build.extra_flags=

# tone() is not supported on tiny10, we only have one timer
# and millis() needs it
attiny9_diy.menu.core.SmallerCore=Millis Available, No Tone
attiny9_diy.menu.core.SmallerCore.build.core=tiny
attiny9_diy.menu.core.SmallerCore.build.extra_flags=-DNO_TONE

attiny9_diy.menu.core.SmallestCore=No Millis, No Tone
attiny9_diy.menu.core.SmallestCore.build.core=tiny
attiny9_diy.menu.core.SmallestCore.build.extra_flags=-DNO_MILLIS -DNO_TONE

# Millis Accuracy
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
attiny9_diy.menu.millis_ppm.1p6=Better Or Equal 1.666% Error (Default)
attiny9_diy.menu.millis_ppm.1p6.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=16666UL

attiny9_diy.menu.millis_ppm.50p=Better Or Equal 50% Error (Lowest Code Use)
attiny9_diy.menu.millis_ppm.50p.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=500000UL

attiny9_diy.menu.millis_ppm.25p=Better Or Equal 25% Error
attiny9_diy.menu.millis_ppm.25p.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=250000UL

attiny9_diy.menu.millis_ppm.10p=Better Or Equal 10% Error
attiny9_diy.menu.millis_ppm.10p.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=100000UL

attiny9_diy.menu.millis_ppm.5p=Better Or Equal 5% Error
attiny9_diy.menu.millis_ppm.5p.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=50000UL

attiny9_diy.menu.millis_ppm.2p5=Better Or Equal 2.5% Error
attiny9_diy.menu.millis_ppm.2p5.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=25000UL

attiny9_diy.menu.millis_ppm.1p=Better Or Equal 1% Error
attiny9_diy.menu.millis_ppm.1p.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=10000UL

attiny9_diy.menu.millis_ppm.0p5=Better Or Equal 0.5% Error
attiny9_diy.menu.millis_ppm.0p5.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=5000UL

attiny9_diy.menu.millis_ppm.0p25=Better Or Equal 0.25% Error
attiny9_diy.menu.millis_ppm.0p25.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=2500UL

attiny9_diy.menu.millis_ppm.0p1=Better Or Equal 0.1% Error (Highest Code Use)
attiny9_diy.menu.millis_ppm.0p1.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=1000UL


# Print Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
attiny9_diy.menu.print.default=Bin Only Supported (Smallest)
attiny9_diy.menu.print.default.build.custom_flags.print.use_base=-DPRINT_USE_BASE_BIN

attiny9_diy.menu.print.Arbitrary=Full Support For Arbitrary Bases (Biggest)
attiny9_diy.menu.print.Arbitrary.build.custom_flags.print.use_base=-DPRINT_USE_BASE_ARBITRARY

attiny9_diy.menu.print.BinHexDecOct=Bin, Hex, Dec, Oct Supported
attiny9_diy.menu.print.BinHexDecOct.build.custom_flags.print.use_base=-DPRINT_USE_BASE_BIN -DPRINT_USE_BASE_DEC -DPRINT_USE_BASE_HEX -DPRINT_USE_BASE_OCT

attiny9_diy.menu.print.BinHexDec=Bin, Hex, Dec Supported
attiny9_diy.menu.print.BinHexDec.build.custom_flags.print.use_base=-DPRINT_USE_BASE_BIN -DPRINT_USE_BASE_DEC -DPRINT_USE_BASE_HEX

attiny9_diy.menu.print.Dec=Dec Only Supported
attiny9_diy.menu.print.Dec.build.custom_flags.print.use_base=-DPRINT_USE_BASE_DEC

attiny9_diy.menu.print.Hex=Hex Only Supported
attiny9_diy.menu.print.Hex.build.custom_flags.print.use_base=-DPRINT_USE_BASE_HEX

attiny9_diy.menu.print.Oct=Oct Only Supported
attiny9_diy.menu.print.Oct.build.custom_flags.print.use_base=-DPRINT_USE_BASE_OCT

attiny9_diy.menu.print.Bin=Bin Only Supported (Smallest)
attiny9_diy.menu.print.Bin.build.custom_flags.print.use_base=-DPRINT_USE_BASE_BIN

# Serial Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
attiny9_diy.menu.serial.HalfDuplexRW=Half Duplex, Read+Write
attiny9_diy.menu.serial.HalfDuplexRW.build.custom_flags.serial.use_serial_type=-DUSE_SERIAL_TYPE=SERIAL_TYPE_HALF_DUPLEX

attiny9_diy.menu.serial.HalfDuplexRWStream=Half Duplex, Read+Write Inherits Stream
attiny9_diy.menu.serial.HalfDuplexRWStream.build.custom_flags.serial.use_serial_type=-DUSE_SERIAL_TYPE=SERIAL_TYPE_HALF_DUPLEX -DHALFDUPLEXSERIAL_INHERIT_FROM=Stream

attiny9_diy.menu.serial.HalfDuplexRStream=Half Duplex, Read Only Inherits Stream
attiny9_diy.menu.serial.HalfDuplexRStream.build.custom_flags.serial.use_serial_type=-DUSE_SERIAL_TYPE=SERIAL_TYPE_HALF_DUPLEX -DHALF_DUPLEX_SERIAL_DISABLE_WRITE -DHALFDUPLEXSERIAL_INHERIT_FROM=Stream

attiny9_diy.menu.serial.HalfDuplexWStream=Half Duplex, Write Only Inherits Stream
attiny9_diy.menu.serial.HalfDuplexWStream.build.custom_flags.serial.use_serial_type=-DUSE_SERIAL_TYPE=SERIAL_TYPE_HALF_DUPLEX -DHALF_DUPLEX_SERIAL_DISABLE_READ

# Link Time Optimisation
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
attiny9_diy.menu.lto.enable=LTO Enabled
attiny9_diy.menu.lto.enable.ltocflags=-flto -DLTO_ENABLED -fno-fat-lto-objects
attiny9_diy.menu.lto.enable.ltoelfflags=-g -flto -DLTO_ENABLED -fuse-linker-plugin
attiny9_diy.menu.lto.enable.ltocppflags=-flto -DLTO_ENABLED
attiny9_diy.menu.lto.enable.ltoarcmd=gcc-
attiny9_diy.menu.lto.disable=LTO Disabled
attiny9_diy.menu.lto.disable.ltocflags=
attiny9_diy.menu.lto.disable.ltoelfflags=
attiny9_diy.menu.lto.disable.ltocppflags=
attiny9_diy.menu.lto.disable.ltoarcmd=


# }}}





################################################################################
# ATtiny5
#
# There is only 1 fuse on this series of chips, it really doesn't do much.
#
# Fuse
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
#  See page 154 of Datasheet
#
#   avrdude DOES NOT mask the fuse bits
#
#   0xFF = Default (Reset Enabled, WDT Not Always On, Clock Not Output)
#
# Lock Bits
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
#  See page 153 of Datasheet
#
#  avrdude DOES NOT mask the lock bits
#
#    0xFF = No Locking
#    0xFE = Write Locked
#    0xFC = Read and Write Locked
#
# Important: Lock bits must be set after setting the fuse.
#
################################################################################

