sleemanj/optiboot/dists/diy_attiny/avr/boards.txt
# {{{ ############### ATtiny5 ##################################################

attiny5_diy.name=ATtiny5
attiny5_diy.build.mcu=attiny5
attiny5_diy.bootloader.fuse=0xFF
attiny5_diy.bootloader.unlock_bits=0xFF
attiny5_diy.bootloader.lock_bits=0xFF
attiny5_diy.build.f_cpu=8000000L
attiny5_diy.upload.speed=57600
attiny5_diy.build.core=tiny
attiny5_diy.build.variant=tiny5_10
attiny5_diy.build.board=ATTINY5_DIY
attiny5_diy.upload.tool=diy_attiny:avrdude_nobootloader_onefuse
attiny5_diy.bootloader.tool=diy_attiny:avrdude_nobootloader_onefuse
attiny5_diy.upload.maximum_data_size=32

# Version Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# Only one version, no sense including this menu
# attiny5_diy.menu.version.attiny5 = ATtiny5
# attiny5_diy.menu.version.attiny5.build.mcu = attiny5

# Speed Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# The frequency on the Reduced Core tinyAVR is set at runtime by way of a 
# prescaler (power of 2) on the internal 8MHz oscillator.
#
# See pins_arduino.h setCPUFrequency()

attiny5_diy.menu.clock.8MHz=8MHz
attiny5_diy.menu.clock.8MHz.build.f_cpu=8000000L

attiny5_diy.menu.clock.4MHz=4MHz
attiny5_diy.menu.clock.4MHz.build.f_cpu=4000000L

attiny5_diy.menu.clock.2MHz=2MHz
attiny5_diy.menu.clock.2MHz.build.f_cpu=2000000L

attiny5_diy.menu.clock.1MHz=1MHz
attiny5_diy.menu.clock.1MHz.build.f_cpu=1000000L

# These frequencies under 1MHz need some work
#  something is wrong with delayMicroSecondsAdjusted, running too fast
#  could be a memory issue maybe.

# attiny5_diy.menu.clock.500kHz=500kHz
# attiny5_diy.menu.clock.500kHz.build.f_cpu=500000L

# attiny5_diy.menu.clock.250kHz=250kHz
# attiny5_diy.menu.clock.250kHz.build.f_cpu=250000L

# attiny5_diy.menu.clock.125kHz=125kHz
# attiny5_diy.menu.clock.125kHz.build.f_cpu=125000L


# Bootloader Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

# Sorry attiny5, you're too small for bootloaders.
#
# attiny5_diy.menu.boot.optiboot=Yes (Normal Arduino Serial/USB Upload)
# attiny5_diy.menu.boot.optiboot.upload.protocol=arduino
# attiny5_diy.menu.boot.optiboot.upload.maximum_size=457
# attiny5_diy.menu.boot.optiboot.bootloader.extended_fuses=0xEB
# attiny5_diy.menu.boot.optiboot.bootloader.file=optiboot_{build.mcu}_{build.f_cpu}_{upload.speed}.hex

attiny5_diy.menu.boot.none=No (TPI Programmer Upload)
attiny5_diy.menu.boot.none.upload.maximum_size=512
attiny5_diy.menu.boot.none.bootloader.tool=diy_attiny:avrdude_nobootloader_onefuse

# Core Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
#attiny5_diy.menu.core.FullCore=Millis and Tone Available
#attiny5_diy.menu.core.FullCore.build.core=tiny
#attiny5_diy.menu.core.FullCore.build.extra_flags=

# tone() is not supported on tiny5
attiny5_diy.menu.core.SmallerCore=Millis Available, No Tone
attiny5_diy.menu.core.SmallerCore.build.core=tiny
attiny5_diy.menu.core.SmallerCore.build.extra_flags=-DNO_TONE

attiny5_diy.menu.core.SmallestCore=No Millis, No Tone
attiny5_diy.menu.core.SmallestCore.build.core=tiny
attiny5_diy.menu.core.SmallestCore.build.extra_flags=-DNO_MILLIS -DNO_TONE

# Millis Accuracy
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
attiny5_diy.menu.millis_ppm.1p6=Better Or Equal 1.666% Error (Default)
attiny5_diy.menu.millis_ppm.1p6.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=16666UL

attiny5_diy.menu.millis_ppm.50p=Better Or Equal 50% Error (Lowest Code Use)
attiny5_diy.menu.millis_ppm.50p.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=500000UL

attiny5_diy.menu.millis_ppm.25p=Better Or Equal 25% Error
attiny5_diy.menu.millis_ppm.25p.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=250000UL

attiny5_diy.menu.millis_ppm.10p=Better Or Equal 10% Error
attiny5_diy.menu.millis_ppm.10p.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=100000UL

attiny5_diy.menu.millis_ppm.5p=Better Or Equal 5% Error
attiny5_diy.menu.millis_ppm.5p.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=50000UL

attiny5_diy.menu.millis_ppm.2p5=Better Or Equal 2.5% Error
attiny5_diy.menu.millis_ppm.2p5.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=25000UL

attiny5_diy.menu.millis_ppm.1p=Better Or Equal 1% Error
attiny5_diy.menu.millis_ppm.1p.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=10000UL

attiny5_diy.menu.millis_ppm.0p5=Better Or Equal 0.5% Error
attiny5_diy.menu.millis_ppm.0p5.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=5000UL

attiny5_diy.menu.millis_ppm.0p25=Better Or Equal 0.25% Error
attiny5_diy.menu.millis_ppm.0p25.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=2500UL

attiny5_diy.menu.millis_ppm.0p1=Better Or Equal 0.1% Error (Highest Code Use)
attiny5_diy.menu.millis_ppm.0p1.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=1000UL


# Print Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
attiny5_diy.menu.print.default=Bin Only Supported (Smallest)
attiny5_diy.menu.print.default.build.custom_flags.print.use_base=-DPRINT_USE_BASE_BIN

attiny5_diy.menu.print.Arbitrary=Full Support For Arbitrary Bases (Biggest)
attiny5_diy.menu.print.Arbitrary.build.custom_flags.print.use_base=-DPRINT_USE_BASE_ARBITRARY

attiny5_diy.menu.print.BinHexDecOct=Bin, Hex, Dec, Oct Supported
attiny5_diy.menu.print.BinHexDecOct.build.custom_flags.print.use_base=-DPRINT_USE_BASE_BIN -DPRINT_USE_BASE_DEC -DPRINT_USE_BASE_HEX -DPRINT_USE_BASE_OCT

attiny5_diy.menu.print.BinHexDec=Bin, Hex, Dec Supported
attiny5_diy.menu.print.BinHexDec.build.custom_flags.print.use_base=-DPRINT_USE_BASE_BIN -DPRINT_USE_BASE_DEC -DPRINT_USE_BASE_HEX

attiny5_diy.menu.print.Dec=Dec Only Supported
attiny5_diy.menu.print.Dec.build.custom_flags.print.use_base=-DPRINT_USE_BASE_DEC

attiny5_diy.menu.print.Hex=Hex Only Supported
attiny5_diy.menu.print.Hex.build.custom_flags.print.use_base=-DPRINT_USE_BASE_HEX

attiny5_diy.menu.print.Oct=Oct Only Supported
attiny5_diy.menu.print.Oct.build.custom_flags.print.use_base=-DPRINT_USE_BASE_OCT

