sleemanj/optiboot/dists/diy_attiny/avr/boards.txt
attiny10_diy.menu.millis_ppm.1p=Better Or Equal 1% Error
attiny10_diy.menu.millis_ppm.1p.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=10000UL

attiny10_diy.menu.millis_ppm.0p5=Better Or Equal 0.5% Error
attiny10_diy.menu.millis_ppm.0p5.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=5000UL

attiny10_diy.menu.millis_ppm.0p25=Better Or Equal 0.25% Error
attiny10_diy.menu.millis_ppm.0p25.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=2500UL

attiny10_diy.menu.millis_ppm.0p1=Better Or Equal 0.1% Error (Highest Code Use)
attiny10_diy.menu.millis_ppm.0p1.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=1000UL


# Print Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
attiny10_diy.menu.print.default=Bin Only Supported (Smallest)
attiny10_diy.menu.print.default.build.custom_flags.print.use_base=-DPRINT_USE_BASE_BIN

attiny10_diy.menu.print.Arbitrary=Full Support For Arbitrary Bases (Biggest)
attiny10_diy.menu.print.Arbitrary.build.custom_flags.print.use_base=-DPRINT_USE_BASE_ARBITRARY

attiny10_diy.menu.print.BinHexDecOct=Bin, Hex, Dec, Oct Supported
attiny10_diy.menu.print.BinHexDecOct.build.custom_flags.print.use_base=-DPRINT_USE_BASE_BIN -DPRINT_USE_BASE_DEC -DPRINT_USE_BASE_HEX -DPRINT_USE_BASE_OCT

attiny10_diy.menu.print.BinHexDec=Bin, Hex, Dec Supported
attiny10_diy.menu.print.BinHexDec.build.custom_flags.print.use_base=-DPRINT_USE_BASE_BIN -DPRINT_USE_BASE_DEC -DPRINT_USE_BASE_HEX

attiny10_diy.menu.print.Dec=Dec Only Supported
attiny10_diy.menu.print.Dec.build.custom_flags.print.use_base=-DPRINT_USE_BASE_DEC

attiny10_diy.menu.print.Hex=Hex Only Supported
attiny10_diy.menu.print.Hex.build.custom_flags.print.use_base=-DPRINT_USE_BASE_HEX

attiny10_diy.menu.print.Oct=Oct Only Supported
attiny10_diy.menu.print.Oct.build.custom_flags.print.use_base=-DPRINT_USE_BASE_OCT

attiny10_diy.menu.print.Bin=Bin Only Supported (Smallest)
attiny10_diy.menu.print.Bin.build.custom_flags.print.use_base=-DPRINT_USE_BASE_BIN

# Serial Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
attiny10_diy.menu.serial.HalfDuplexRW=Half Duplex, Read+Write
attiny10_diy.menu.serial.HalfDuplexRW.build.custom_flags.serial.use_serial_type=-DUSE_SERIAL_TYPE=SERIAL_TYPE_HALF_DUPLEX

attiny10_diy.menu.serial.HalfDuplexRWStream=Half Duplex, Read+Write Inherits Stream
attiny10_diy.menu.serial.HalfDuplexRWStream.build.custom_flags.serial.use_serial_type=-DUSE_SERIAL_TYPE=SERIAL_TYPE_HALF_DUPLEX -DHALFDUPLEXSERIAL_INHERIT_FROM=Stream

attiny10_diy.menu.serial.HalfDuplexRStream=Half Duplex, Read Only Inherits Stream
attiny10_diy.menu.serial.HalfDuplexRStream.build.custom_flags.serial.use_serial_type=-DUSE_SERIAL_TYPE=SERIAL_TYPE_HALF_DUPLEX -DHALF_DUPLEX_SERIAL_DISABLE_WRITE -DHALFDUPLEXSERIAL_INHERIT_FROM=Stream

attiny10_diy.menu.serial.HalfDuplexWStream=Half Duplex, Write Only Inherits Stream
attiny10_diy.menu.serial.HalfDuplexWStream.build.custom_flags.serial.use_serial_type=-DUSE_SERIAL_TYPE=SERIAL_TYPE_HALF_DUPLEX -DHALF_DUPLEX_SERIAL_DISABLE_READ

# Link Time Optimisation
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
attiny10_diy.menu.lto.enable=LTO Enabled
attiny10_diy.menu.lto.enable.ltocflags=-flto -DLTO_ENABLED -fno-fat-lto-objects
attiny10_diy.menu.lto.enable.ltoelfflags=-g -flto -DLTO_ENABLED -fuse-linker-plugin
attiny10_diy.menu.lto.enable.ltocppflags=-flto -DLTO_ENABLED
attiny10_diy.menu.lto.enable.ltoarcmd=gcc-
attiny10_diy.menu.lto.disable=LTO Disabled
attiny10_diy.menu.lto.disable.ltocflags=
attiny10_diy.menu.lto.disable.ltoelfflags=
attiny10_diy.menu.lto.disable.ltocppflags=
attiny10_diy.menu.lto.disable.ltoarcmd=


# }}}


